[
  {
    "role": "iOS App Developer",
    "level": "Intern",
    "company": "SAP",
    "startDate": "Mar, 2017",
    "endDate": "Aug, 2017",
    "description": "As a member of a multinational project team, I independently developed a native iOS app using Swift. Having no prior knowledge with Swift nor native app development, I quickly and independently learned how to implement authentication, connect to a REST API, and read iPhone sensor data. I also gained insight into the design process and was able to actively contribute. Thanks to my structured way of working, I was able to meet milestones and report progress to the project manager in regular meetings.",
    "experiences": [
      "Swift",
      "UX Design"
    ],
    "imageSrc": "experience/sap.png"
  },
  {
    "role": "iOS App Developer",
    "level": "Working Student",
    "company": "SAP",
    "startDate": "Sep, 2017",
    "endDate": "Aug, 2018",
    "description": "I independently worked on existing native iOS applications to implement new features.",
    "experiences": [
      "Swift",
      "placeholder"
    ],
    "imageSrc": "experience/sap.png"
  },
  {
    "role": "Full Stack Developer",
    "level": "Working Student",
    "company": "SAP",
    "startDate": "Nov, 2018",
    "endDate": "Feb, 2020",
    "description": "",
    "experiences": [
      "Java",
      "SAP UI5"
    ],
    "imageSrc": "experience/sap.png"
  },
  {
    "role": "Unreal Engine Developer",
    "level": "Working Student",
    "company": "SAP",
    "startDate": "Mar, 2020",
    "endDate": "Dec, 2023",
    "description": "I worked with Unreal Engine 5 to implement a VR multiplayer experience in a proactive and self-structured manner. I integrated my feature into a larger modular project which involved adapting to unfamiliar codebases and collaborating with team members to ensure cohesion within the project framework. We utilized GitLab for version control and collaborative development. \n\nFurthermore, I experimented with motion capture from single-view images as well as hand- and face tracking using the Quest Pro for the creation of virtual humanoid guides. Being very ambituous, I achieved to tackle challenges in this innovative and fast-changing domain. In addition, I presented my findings in multinational knowledge exchange sessions.",
    "experiences": [
      "Unreal Engine 4 + 5",
      "Meta Quest"
    ],
    "imageSrc": "experience/sap.png"
  }
]