[
  {
    "title": "Human Tour Guides for Mixed Reality: A Comparison of Capture and Display Techniques",
    "imageSrc": "projects/guides.png",
    "description": "Virtual environments can be complex and overwhelming. In addition, when wearing a bulky head-mounted display one easily feels isolated from the real world. \n For my Master's thesis I investigated how humanoid embodied tour guides could be created to accompany and guide users in a Mixed Reality environment.",
    "skills": [
      "Unreal Engine",
      "Meta Quest",
      "XR",
      "Motion Capture"
    ],
    "year": "2023",
    "context": "Masters Thesis at TU Dresden towards M.Sc. Computer Science and Media",
    "contribution": "all",
    "details": "humantourguides",
    "detailsSections": [
      {
        "title": "Introduction",
        "text": "Working with UE4 and Meta's Quest Pro, I created a Mixed Reality art gallery prototype. I used the prototype as context to test three different representations of guides with varying degrees of visual realism. To simplify the creation process I looked at ways of recording real tour guides to transfer their behavioral realism onto the virtual guides. For example, I explored the Quest's body and face tracking to animate a MetaHuman. Through user testing, I then compared the representations towards Social Presence and overall user acceptance.",
        "mediaSrc": "projects/guides.png",
        "mediaType": "img",
        "layout": 1
      },
      {
        "title": "Background and Aims",
        "text": "Virtual environments can be complex and overwhelming. In addition, when wearing a bulky head-mounted display one easily feels isolated from the real world. For my Master's thesis I investigated how humanoid embodied tour guides could be created to accompany and guide users in a Mixed Reality environment. Furthermore, I was interested in how the guide could efficiently explain content by applying Joint Attention Mechanisms such as Pointing and Gaze direction supported by verbal terms. I aimed to increase Social Presence to provide a trustworthy company, mental support and increase the level of comfort.",
        "mediaSrc": "projects/humantourguides/aims.png",
        "mediaType": "img",
        "layout": 2
      },
      {
        "title": "The Guide's Characteristics",
        "text": "State-of-the-Art guidance varies in terms of visual realism, level of embodiment and how they integrate into the immersive environment (Spatial Accuracy). While I explicitly sought to compare different levels of visual realism, the characteristics of the representations I compared cover all degrees for each characteristic trait.",
        "mediaSrc": "projects/humantourguides/characteristics.png",
        "mediaType": "img",
        "layout": 1
      },
      {
        "title": "Recording Techniques",
        "text": "As I ended up comparing one video based guide and two synthetic guides I needed different approaches for recording.",
        "mediaSrc": "projects/humantourguides/recordingtechniques.png",
        "mediaType": "img",
        "layout": 2
      },
      {
        "title": "Recording the Video Guide",
        "text": "For the video guide I recorded a video using an iPad. The position of the iPad was tracked throughout the video recording to derivate the guide's position in space.",
        "mediaSrc": "projects/humantourguides/stepsvideorecording.png",
        "mediaType": "img",
        "layout": 1
      },
      {
        "title": "Recording the Synthetic Guides",
        "text": "I explored different techniques to extract motion data from a single view image. They did not suffice to simultaneously track position in space, accurate hand gestures and facial expressions. I ended up using the Quest Pro's motion tracking capabilities to record hands, face and position of the guide.",
        "mediaSrc": "PphSfkBe85A",
        "mediaType": "vid",
        "layout": 2
      },
      {
        "title": "Mixed Reality Prototype",
        "text": "The MR Prototype I developed has two different modes: An admin Mode for recording a guided tour and a visitor mode to participate in a guided tour.",
        "mediaSrc": "projects/humantourguides/appmodes.png",
        "mediaType": "img",
        "layout": 1
      },
      {
        "title": "Interaction",
        "text": "I provided the user with a personal menu. Whenever a hand is rotated towards the face with all fingers stretched, the menu appears. This gesture is more comfortable and reliable than a 'looking-at-a-watch' gesture. The user does then interact with the menu by tapping the buttons.",
        "mediaSrc": "projects/guidesmenu.png",
        "mediaType": "img",
        "layout": 2
      },
      {
        "title": "User Testing",
        "text": "I ran user tests to compare the guides. The graphic shows the testing procedure consisting of 3 steps.",
        "mediaSrc": "projects/humantourguides/usertests.png",
        "mediaType": "img",
        "layout": 1
      }
    ],
    "source": ""
  },
  {
    "title": "InPen",
    "imageSrc": "projects/inPen.png",
    "description": "We applied different Design Thinking tools to work out a business model. We came up with an accessible online shopping experience.",
    "skills": [
      "Design Thinking",
      "Business Model Canvas",
      "Adobe After Effects",
      "Adobe Illustrator",
      "Teamwork"
    ],
    "year": "",
    "context": "Group Project for Course Software as a Business",
    "contribution": "",
    "details": "inpen",
    "detailsSections": [
      {
        "title": "SMOKE Video",
        "text": "I created this video using Adobe Illustrator, Adobe After Effects and Adobe Premiere Pro.",
        "mediaSrc": "6NvgkwtNZEk",
        "mediaType": "vid",
        "layout": 1
      }
    ],
    "source": ""
  },
  {
    "title": "Traffic Stream: Waiting Times",
    "imageSrc": "projects/trafficStream.png",
    "description": "For a semester project, in a group of 2 we implemented an interactive prototype with React, TypeScript, deck.gl and mapbox to visualize traffic data on a map. The app comprises an overview and detail view to visualize waiting times and routes of cyclists at street crossings. We came up with a design concept to improve the User Experience and create a clearly arranged User Interface which we presented and discussed in regular meetings with the product owners.",
    "skills": [
      "React",
      "TypeScript",
      "Docker",
      "deck.gl",
      "mapbox",
      "node.js",
      "express",
      "UX Design",
      "UI Design",
      "Data Visualization",
      "Figma"
    ],
    "year": "2020",
    "context": "Group project for course Mobile and Ubiquituous Computing; group of 2",
    "contribution": "Equal distribution of tasks",
    "details": "trafficstream",
    "detailsSections": [
      {
        "title": "Claims Analysis",
        "text": "We did a claims analysis as basis for design decisions.",
        "mediaSrc": "projects/trafficstreamclaimspersp.png",
        "mediaType": "img",
        "layout": 1
      },
      {
        "title": "Visual Design",
        "text": "We used Figma to create a visual design concept.",
        "mediaSrc": "projects/trafficstreamdesignprocess.png",
        "mediaType": "img",
        "layout": 2
      },
      {
        "title": "Interaction Design",
        "text": "We aimed for an intuitive interaction to select multiple waiting points and group them to a street crossing. We evaluated different approaches towards usability, intuitiveness and implementation.",
        "mediaSrc": "projects/trafficstreaminteractiondesign.png",
        "mediaType": "img",
        "layout": 1
      },
      {
        "title": "Overview, Zoom and Filter, Details on Demand",
        "text": "We followed Shneiderman's visualization mantra \"Overview first, zoom and filter, details on demand\".",
        "mediaSrc": "projects/trafficstreamcrossing.png",
        "mediaType": "img",
        "layout": 2
      }
    ],
    "source": ""
  },
  {
    "title": "VR Data Room",
    "imageSrc": "",
    "description": "",
    "skills": [
      "Interactive Data Visualization",
      "VR",
      "UX Design"
    ],
    "year": "",
    "context": "",
    "contribution": "",
    "details": "",
    "detailsSections": [
      {
        "title": "",
        "text": "",
        "mediaSrc": "",
        "mediaType": "",
        "layout": 1
      }
    ],
    "source": ""
  },
  {
    "title": "Quest's Face Tracking for MetaHuman",
    "imageSrc": "projects/faceTrackingMetaHuman.png",
    "description": "Meta's Quest Pro comes with face tracking. By using a Meta's version of the Unreal Engine 4, I applied the face tracking values to animate a Meta Human's face. ",
    "skills": [
      "Motion Capture",
      "VR",
      "MetaHuman",
      "Unreal Engine",
      "Meta Quest Pro"
    ],
    "year": "",
    "context": "",
    "contribution": "",
    "details": "facetracking",
    "detailsSections": [
      {
        "title": "",
        "text": "",
        "mediaSrc": "PphSfkBe85A",
        "mediaType": "vid",
        "layout": 1
      }
    ],
    "source": ""
  },
  {
    "title": "Ballet Lesson",
    "imageSrc": "projects/ballet.png",
    "description": "For a semester project, I had to create a little animated scene. Therefore, I wrote a story board, rigged the Lego man and animated the scene.",
    "skills": [
      "Maya",
      "Animation",
      "Rigging",
      "Storyboard"
    ],
    "year": "",
    "context": "",
    "contribution": "",
    "details": "ballettlesson",
    "detailsSections": [
      {
        "title": "Animation with Maya",
        "text": "",
        "mediaSrc": "JFvHMj6h5lE",
        "mediaType": "vid",
        "layout": 1
      }
    ],
    "source": ""
  },
  {
    "title": "Shopping Knob",
    "imageSrc": "projects/navigating.png",
    "description": "The goal was to develop a prototype to support a healthier lifestyle.",
    "skills": [
      "Stakeholder Analysis",
      "Personas",
      "Claims",
      "Prototyping",
      "Storyboard"
    ],
    "year": "2018",
    "context": "University project for the course User Interface Engineering; group size: 4",
    "contribution": "contribution to all phases",
    "details": "shopknob",
    "detailsSections": [
      {
        "title": "Brainstorming",
        "text": "We started off with brainstorming to come up with first visions and ideas. Based off of a collection of factors which make up a healthy lifestyle we decided on the reduction of stress. We thought of situations in which we are usually stressed and running back and forth in an overcrowded supermarket to find all items is definitely one of them",
        "mediaSrc": "projects/shopknobbrainstorming.png",
        "mediaType": "img",
        "layout": 1
      },
      {
        "title": "Analysis Phase",
        "text": "The analysis phase consisted of field studies, interviews, stakeholderdiagram, definition of personas and a hierarchical task analysis (see fig.).",
        "mediaSrc": "projects/shopknobhta.png",
        "mediaType": "img",
        "layout": 2
      },
      {
        "title": "Design Phase",
        "text": "The design phase comprised Activity Design, Information Design and Interaction Design. For each design phase we summed up the features to rate them towards future implementation. The design phases led us to a storyboard and a paper prototype. \n We listed problem scenarios and transformed them into activity scenarios to get an idea of how the personas would address their problems as of now. We then put together claims to rate the key features of the activity design. Next, based on the activity design, we listed information design scenarios to find ways to support the activities. Again, a table of claims helped us to rate the information design features.",
        "mediaSrc": "projects/shopknobstoryboard.png",
        "mediaType": "img",
        "layout": 1
      },
      {
        "title": "User Testing",
        "text": "We ran user tests to find out how our prototype performs. The subjects had to complete a set of tasks and were asked to \"think out loud\" and answer a questionnaire.",
        "mediaSrc": "projects/shopknobprototype.png",
        "mediaType": "img",
        "layout": 2
      }
    ],
    "source": ""
  },
  {
    "title": "Smart Home",
    "imageSrc": "",
    "description": "Setting up a Smart Home to control heating, lighting and multimedia.",
    "skills": [
      "UX Design",
      "System Architecture",
      "ioBroker",
      "Stakeholder Analysis",
      "node.js",
      "TypeScript",
      "mqtt"
    ],
    "year": "2024",
    "context": "personal",
    "contribution": "development, UX Design",
    "details": "smarthome",
    "detailsSections": [
      {
        "title": "Background",
        "text": "We have a Smart Home at home which isn't as smart as it could be. We have window sensors which are potentially be able to send a signal to the heating thermostats and tell them to switch off when the window is open. But the communication is very unreliable. Moreover, at the moment they make regulating the temperature rather more complicated than easier. We have a dolby surround system which can connect an additional speaker in the kitchen area. However, they always need to be manually connected and disconnected when switch between listening to music and watching TV. We have lighting which can only be fully controlled via a smart phone app. In summary, our smart home relies on a variety of apps and is inaccessible for visitors.",
        "mediaSrc": "",
        "mediaType": "",
        "layout": 1
      },
      {
        "title": "Stakeholders",
        "text": "",
        "mediaSrc": "",
        "mediaType": "",
        "layout": 2
      },
      {
        "title": "Seth",
        "text": "30 years   |   lives with girlfriend and toddler in city apartment   |   loves technology   |   works full-time\n\nSeth lives in a city apartment together with his girlfriend and toddler. He loves technology and sets up a smart home to control heating, lighting, sound system and watering the plants on the balcony. As he works full-time, he has set up the heating to follow a schedule and automatically turn off for when no one is at home and turn back on for when everyone gets home. For when he’s sick at home or works remotely, he has set up a separate schedule which can be switched to via a smartphone app. More fine-grained adjustments need to be tediously done via a browser app. Some heating thermostats have a child lock as his toddler loves to push buttons, so they can be exclusively adjusted via a smart phone app. \nIn addition, Seth has set up a 5.1 sound system and an extra speaker in the kitchen. When he listens to music via Spotify, he manually connects the extra speaker for the music to play in the living room and the kitchen simultaneously. When he wants to watch TV, he has to disconnect the speaker via the sound systems (Onkyo) smartphone app. Plus, when watching TV he always has to turn up the volume as it’s way too quiet. \nSeth dims the light when watching TV for a cozier atmosphere. The floor lamp has a smart bulb which can be controlled via the FRITZ! Home app. He can adjust brightness and color. The lamp itself does not have a switch. \nThe balcony plants are equipped with small hoses which are connected to the kitchen water tap. When Seth goes on vacation, he can water his plants by remotely controlling the valves. Moreover, he put humidity sensors in the planters to track the water level.\n\n Image Source: https://www.flaticon.com/free-icons/man (Freepik - Flaticon)",
        "mediaSrc": "projects/smarthome/personas/seth.png",
        "mediaType": "img",
        "layout": 1
      },
      {
        "title": "Kristin",
        "text": "59 years   |   kids live far away   |   comfortable with basic interaction with smartphones   |   loves a good TV show\n\nKristins daughter moved to another city after school where she now lives with her own little family. It’s a 7-hour drive to visit, so when she visits her daughter, she usually stays for a few days. Her daughter has a guest room where she stays in. \n The guest rooms heating is controlled via a schedule which is set up to keep the temperature at a low level as the room is usually not regularly occupied. So when Kristin wants to adjust the temperature, she manually has to push a tiny button a couple of times and the thermostats response time is quite low. The temperature is reset at some point as triggered by the schedule.\n When Kristin wants to watch TV while the others are out of the house, it often won’t work. She doesn’t have the Onkyo app on her smartphone to disconnect the kitchen speaker. Even if she did, she wouldn’t remember what to do. \n Furthermore, she cannot adjust the living room heater thermostats as they are locked and she doesn’t have the FRITZ! Home app on her smartphone.\n\nImage Source: https: //www.flaticon.com/free-icons/avatar (Freepik - Flaticon)",
        "mediaSrc": "projects/smarthome/personas/kristin.png",
        "mediaType": "img",
        "layout": 2
      },
      {
        "title": "Granny",
        "text": "83 years   |   feels uncomfortable with technology   |   is always cold\n\nGranny loves to visit her family. Her grandson has set up this weird smart home thing where they do not have normal thermostats. As she is always cold, she wants to turn on the heating. However, the thermostats cannot simply be rotated, they have tiny buttons and a teeny tiny display which shows the desired temperature. She always needs to ask her grandkids to adjust the temperature.\n\nImage Source: https://www.flaticon.com/free-icons/woman (Freepik - Flaticon)",
        "mediaSrc": "projects/smarthome/personas/granny.png",
        "mediaType": "img",
        "layout": 1
      },
      {
        "title": "Elena",
        "text": "28 years   |   loves seeing her friends   |   always listens to music, especially less known bands\n\nImage Source: https://www.flaticon.com/free-icons/woman (Freepik - Flaticon)",
        "mediaSrc": "projects/smarthome/personas/elena.png",
        "mediaType": "img",
        "layout": 2
      },
      {
        "title": "Problem Scenarios",
        "text": "I analysed problem scenarios to use them as base to find activity design features. Where applicable I want to automate processes. Moreover, a light switch metaphor could make sense to control smart home devices. When you enter a room you have to perform only one action right when you enter to controll the devices of the specific room. While it makes sense to provide a simplistic quick access interface for guests, more in-depth control is necessary for the admins. To make watering more fun and increase satisfaction, I want to provide visual feedback of the water fill level.",
        "mediaSrc": "projects/smarthome/problemscenarios.png",
        "mediaType": "img",
        "layout": 2
      },
      {
        "title": "Activity Design",
        "text": "I then set up claims to evaluate the activity design features.",
        "mediaSrc": "projects/smarthome/problemscenarios.png",
        "mediaType": "img",
        "layout": 2
      }
    ],
    "source": ""
  },
  {
    "title": "Cooking App Prototype",
    "imageSrc": "projects/KochApp.png",
    "description": "Development of a paper prototype for a cooking app for beginners.",
    "skills": [
      "Prototyping",
      "UX Design",
      "Interface Design"
    ],
    "year": "",
    "context": "University Project; Group Size: 2",
    "contribution": "",
    "details": "woodenspoon",
    "detailsSections": [
      {
        "title": "Paper Prototype",
        "text": "",
        "mediaSrc": "TYa5sqLn8bg",
        "mediaType": "vid",
        "layout": 1
      }
    ],
    "source": ""
  },
  {
    "title": "Sundial",
    "imageSrc": "projects/sundial.jpg",
    "description": "Based off of photographs, I modelled a Sundial using Autodesk Maya.",
    "skills": [
      "Modelling",
      "Maya"
    ],
    "year": "",
    "context": "",
    "contribution": "",
    "details": "",
    "detailsSections": [
      {
        "title": "",
        "text": "",
        "mediaSrc": "",
        "mediaType": "",
        "layout": 1
      }
    ],
    "source": ""
  },
  {
    "title": "Game of Life",
    "imageSrc": "projects/gameoflife2.jpg",
    "description": "I developed Game of Life in C++.",
    "skills": [
      "C++"
    ],
    "year": "",
    "context": "",
    "contribution": "",
    "details": "",
    "detailsSections": [
      {
        "title": "",
        "text": "",
        "mediaSrc": "",
        "mediaType": "",
        "layout": 1
      }
    ],
    "source": ""
  },
  {
    "title": "Design Concept for HTW Dresden Homepage",
    "imageSrc": "projects/WebsiteDesign.jpg",
    "description": "I did a draft for a redesign of the HTW Dresden website using Photoshop.",
    "skills": [
      "Photoshop",
      "Layout"
    ],
    "year": "Redesign existing Homepage using given content. Pay attention to layout guidelines.",
    "context": "Project for Bachelor",
    "contribution": "all",
    "details": "",
    "detailsSections": [
      {
        "title": "",
        "text": "",
        "mediaSrc": "",
        "mediaType": "",
        "layout": 1
      }
    ],
    "source": ""
  },
  {
    "title": "Portfolio",
    "imageSrc": "projects/portfolio.png",
    "description": "Design and implementation of my portfolio. Work in progress.",
    "skills": [
      "Figma",
      "TypeScript",
      "React",
      "CSS"
    ],
    "year": "2024",
    "context": "Personal",
    "contribution": "all",
    "details": "portfolio",
    "detailsSections": [
      {
        "title": "Design in Figma",
        "text": "I'm always open for fun and so should my Portfolio be. I aimed for a design that represents my creative, open-minded and joyful personality. Wow, I find it always weird to describe myself. However. Abstract dynamic elements spread joy and playfulness. The color scheme underlays this concept.",
        "mediaSrc": "projects/portfolio.png",
        "mediaType": "img",
        "layout": 1
      }
    ],
    "source": ""
  },
  {
    "title": "Train Together",
    "imageSrc": "projects/traintogether/prototyp_aussen.jpg",
    "description": "Within 2 weeks, we worked full-time to implement a prototype system to do physical exercises together. The prototype enables the user to ask others to joint a training session via pressing a button. The matrix then displays an execise. LEDs indicate when the exercise starts and ends.",
    "skills": [
      "Arduino",
      "Breadboard",
      "Physical Computing",
      "Prototyping",
      "Fusion 360",
      "Fritzing"
    ],
    "year": "2020",
    "context": "University project for the course Physical Computing; group of 3",
    "contribution": "brainstorming + development of one of three prototypes",
    "details": "traintogether",
    "detailsSections": [
      {
        "title": "Background",
        "text": "As due to Covid we were stuck at home, we decided to implement a prototype system to do physical exercises together. In a group of three, each team member created a physical prototype based on an Arduino. The prototypes communicate with each other to provide a way to invite others for syncronized exercising and to suggest an exercise. The button is used to start an exercise session, the display shows an animation of the exercise.",
        "mediaSrc": "projects/traintogether/prototyp_aussen.jpg",
        "mediaType": "img",
        "layout": 1
      },
      {
        "title": "Materials",
        "text": "We were randomly given a set of components to work with for building our prototype. I had a 8x8 LED Matrix, 3 LEDs and a Photoresistor to work with. I used the photoresistor for going online (when you are up for a training session) and offline (to mute the device when you do not want to exercise). Therefore, you have to take off the head. The LEDs indicate the state with yellow for receiving a training request, green when an exercise is running and red when the exercise is over. Multiple buttons allow to select a body region you want to train. An exercise is randomly suggested under consideration of the chosen body part.",
        "mediaSrc": "projects/traintogether/grundmaterialien.jpg",
        "mediaType": "img",
        "layout": 2
      },
      {
        "title": "Breadboard Setup with Fritzing",
        "text": "",
        "mediaSrc": "projects/traintogether/steckplatine.png",
        "mediaType": "img",
        "layout": 1
      },
      {
        "title": "Breadboard",
        "text": "",
        "mediaSrc": "projects/traintogether/breadboard_setup.jpg",
        "mediaType": "img",
        "layout": 2
      },
      {
        "title": "3D model with Fusion",
        "text": "I designed a 3D Model for the prototype using Fusion 360. The model incorporates the 8x8 matrix, the buttons for the selection of exercises and the LEDs to indicate the state. The head can be taken off to cover (unmute) or uncover (mute) the photoresistor.",
        "mediaSrc": "projects/traintogether/render.png",
        "mediaType": "img",
        "layout": 1
      },
      {
        "title": "Communication",
        "text": "In order to enable an exchange between the devices, they connect to the local WLAN and communicate via a shared server using web sockets. For this purpose, a JSON message format was defined to establish a session, respond to a session request and receive an exercise. The prototype switches states based on those requests.",
        "mediaSrc": "projects/traintogether/states.png",
        "mediaType": "img",
        "layout": 2
      }
    ],
    "source": ""
  }
]